src/cfe/DataProcessors/Отчетдлязаполненияформы22ЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>Отчетдлязаполненияформы22ЖКХ</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cfe/AccumulationRegisters/РеализацияУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РеализацияУслуг</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cfe/AccumulationRegisters/НДСЗаписиКнигиПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>НДСЗаписиКнигиПродаж</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cfe/InformationRegisters/ДБГруппыКонтрагентовДляОплатЖКХАВА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДБГруппыКонтрагентовДляОплатЖКХАВА</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагенты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппыОтчетности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДБГруппыОтчетности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДС18</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДС10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДС0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДС20</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/ДБГруппыОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДБГруппыОтчетности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бюджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Население</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеПотребители</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/DataProcessors/Отчетдлязаполненияформы22ЖКХ/Ext/ObjectModule.bsl
Функция СформироватьПечатнуюФорму(ПараметрыИсп) Экспорт 
	
	Период      = ПараметрыИсп.Период;
	Организация = ПараметрыИсп.Организация;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;	
	
	Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияУслугОбороты.Регистратор КАК Регистратор,
	               |	РеализацияУслугОбороты.Организация КАК Организация,
	               |	РеализацияУслугОбороты.Подразделение КАК Подразделение,
	               |	РеализацияУслугОбороты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	               |	НДСЗаписиКнигиПродаж.Покупатель КАК Покупатель,
	               |	ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.ГруппыОтчетности КАК ГруппыОтчетности,
	               |	РеализацияУслугОбороты.Услуга КАК Услуга,
	               |	РеализацияУслугОбороты.СуммаОборот КАК СуммаБезНДС,
	               |	ВЫБОР
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	               |			ТОГДА 0.18
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	               |			ТОГДА 0.1
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	               |			ТОГДА 0
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	               |			ТОГДА 0.2
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	               |			ТОГДА 0
	               |	КОНЕЦ КАК НДС,
	               |	РеализацияУслугОбороты.СуммаОборот * ВЫБОР
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	               |			ТОГДА 0.18
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	               |			ТОГДА 0.1
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	               |			ТОГДА 0
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	               |			ТОГДА 0.2
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	               |			ТОГДА 0
	               |	КОНЕЦ + РеализацияУслугОбороты.СуммаОборот КАК Итог6,
	               |	0 КАК Итог8,
	               |	0 КАК Итог10,
	               |	0 КАК Итог12,
	               |	NULL КАК Итог7,
	               |	NULL КАК Итог9,
	               |	NULL КАК Итог11,
	               |	NULL КАК Итог13
	               |ПОМЕСТИТЬ Итог
	               |ИЗ
	               |	РегистрНакопления.РеализацияУслуг.Обороты(&НачалоПериода, &КонецПериода, Авто, СчетРасходов = &С90021) КАК РеализацияУслугОбороты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	               |		ПО РеализацияУслугОбороты.Регистратор = НДСЗаписиКнигиПродаж.Регистратор
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДБГруппыКонтрагентовДляОплатЖКХАВА.СрезПоследних КАК ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних
	               |		ПО (НДСЗаписиКнигиПродаж.Организация = ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.Организация)
	               |			И (НДСЗаписиКнигиПродаж.Покупатель = ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.Контрагенты)
	               |ГДЕ
	               |	НДСЗаписиКнигиПродаж.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	               |	И РеализацияУслугОбороты.Организация = &Организация
	               |	И ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.ГруппыОтчетности = ЗНАЧЕНИЕ(Перечисление.ДБГруппыОтчетности.Бюджет)
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияУслугОбороты.Регистратор,
	               |	РеализацияУслугОбороты.Организация,
	               |	РеализацияУслугОбороты.Подразделение,
	               |	РеализацияУслугОбороты.НоменклатурнаяГруппа,
	               |	НДСЗаписиКнигиПродаж.Покупатель,
	               |	ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.ГруппыОтчетности,
	               |	РеализацияУслугОбороты.Услуга,
	               |	РеализацияУслугОбороты.СуммаОборот,
	               |	ВЫБОР
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	               |			ТОГДА 0.18
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	               |			ТОГДА 0.1
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	               |			ТОГДА 0
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	               |			ТОГДА 0.2
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	               |			ТОГДА 0
	               |	КОНЕЦ,
	               |	0,
	               |	РеализацияУслугОбороты.СуммаОборот * ВЫБОР
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	               |			ТОГДА 0.18
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	               |			ТОГДА 0.1
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	               |			ТОГДА 0
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	               |			ТОГДА 0.2
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	               |			ТОГДА 0
	               |	КОНЕЦ + РеализацияУслугОбороты.СуммаОборот,
	               |	0,
	               |	0,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	РегистрНакопления.РеализацияУслуг.Обороты(&НачалоПериода, &КонецПериода, Авто, СчетРасходов = &С90021) КАК РеализацияУслугОбороты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	               |		ПО РеализацияУслугОбороты.Регистратор = НДСЗаписиКнигиПродаж.Регистратор
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДБГруппыКонтрагентовДляОплатЖКХАВА.СрезПоследних КАК ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних
	               |		ПО (НДСЗаписиКнигиПродаж.Организация = ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.Организация)
	               |			И (НДСЗаписиКнигиПродаж.Покупатель = ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.Контрагенты)
	               |ГДЕ
	               |	НДСЗаписиКнигиПродаж.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	               |	И РеализацияУслугОбороты.Организация = &Организация
	               |	И ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.ГруппыОтчетности = ЗНАЧЕНИЕ(Перечисление.ДБГруппыОтчетности.Население)
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияУслугОбороты.Регистратор,
	               |	РеализацияУслугОбороты.Организация,
	               |	РеализацияУслугОбороты.Подразделение,
	               |	РеализацияУслугОбороты.НоменклатурнаяГруппа,
	               |	НДСЗаписиКнигиПродаж.Покупатель,
	               |	ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.ГруппыОтчетности,
	               |	РеализацияУслугОбороты.Услуга,
	               |	РеализацияУслугОбороты.СуммаОборот,
	               |	ВЫБОР
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	               |			ТОГДА 0.18
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	               |			ТОГДА 0.1
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	               |			ТОГДА 0
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	               |			ТОГДА 0.2
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	               |			ТОГДА 0
	               |	КОНЕЦ,
	               |	0,
	               |	0,
	               |	РеализацияУслугОбороты.СуммаОборот * ВЫБОР
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	               |			ТОГДА 0.18
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	               |			ТОГДА 0.1
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	               |			ТОГДА 0
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	               |			ТОГДА 0.2
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	               |			ТОГДА 0
	               |	КОНЕЦ + РеализацияУслугОбороты.СуммаОборот,
	               |	0,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	РегистрНакопления.РеализацияУслуг.Обороты(&НачалоПериода, &КонецПериода, Авто, СчетРасходов = &С90021) КАК РеализацияУслугОбороты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	               |		ПО РеализацияУслугОбороты.Регистратор = НДСЗаписиКнигиПродаж.Регистратор
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДБГруппыКонтрагентовДляОплатЖКХАВА.СрезПоследних КАК ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних
	               |		ПО (НДСЗаписиКнигиПродаж.Организация = ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.Организация)
	               |			И (НДСЗаписиКнигиПродаж.Покупатель = ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.Контрагенты)
	               |ГДЕ
	               |	НДСЗаписиКнигиПродаж.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	               |	И РеализацияУслугОбороты.Организация = &Организация
	               |	И ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.ГруппыОтчетности = ЗНАЧЕНИЕ(Перечисление.ДБГруппыОтчетности.ПрочиеПотребители)
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияУслугОбороты.Регистратор,
	               |	РеализацияУслугОбороты.Организация,
	               |	РеализацияУслугОбороты.Подразделение,
	               |	РеализацияУслугОбороты.НоменклатурнаяГруппа,
	               |	НДСЗаписиКнигиПродаж.Покупатель,
	               |	ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.ГруппыОтчетности,
	               |	РеализацияУслугОбороты.Услуга,
	               |	РеализацияУслугОбороты.СуммаОборот,
	               |	ВЫБОР
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	               |			ТОГДА 0.18
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	               |			ТОГДА 0.1
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	               |			ТОГДА 0
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	               |			ТОГДА 0.2
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	               |			ТОГДА 0
	               |	КОНЕЦ,
	               |	0,
	               |	0,
	               |	0,
	               |	РеализацияУслугОбороты.СуммаОборот * ВЫБОР
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	               |			ТОГДА 0.18
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	               |			ТОГДА 0.1
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	               |			ТОГДА 0
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	               |			ТОГДА 0.2
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	               |			ТОГДА 0
	               |	КОНЕЦ + РеализацияУслугОбороты.СуммаОборот,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	РегистрНакопления.РеализацияУслуг.Обороты(&НачалоПериода, &КонецПериода, Авто, СчетРасходов = &С90021) КАК РеализацияУслугОбороты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	               |		ПО РеализацияУслугОбороты.Регистратор = НДСЗаписиКнигиПродаж.Регистратор
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДБГруппыКонтрагентовДляОплатЖКХАВА.СрезПоследних КАК ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних
	               |		ПО (НДСЗаписиКнигиПродаж.Организация = ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.Организация)
	               |			И (НДСЗаписиКнигиПродаж.Покупатель = ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.Контрагенты)
	               |ГДЕ
	               |	НДСЗаписиКнигиПродаж.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	               |	И РеализацияУслугОбороты.Организация = &Организация
	               |	И ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.ГруппыОтчетности <> ЗНАЧЕНИЕ(Перечисление.ДБГруппыОтчетности.ПрочиеПотребители)
	               |	И ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.ГруппыОтчетности <> ЗНАЧЕНИЕ(Перечисление.ДБГруппыОтчетности.Население)
	               |	И ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.ГруппыОтчетности <> ЗНАЧЕНИЕ(Перечисление.ДБГруппыОтчетности.Бюджет)
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияУслугОбороты.Регистратор,
	               |	РеализацияУслугОбороты.Организация,
	               |	РеализацияУслугОбороты.Подразделение,
	               |	РеализацияУслугОбороты.НоменклатурнаяГруппа,
	               |	НДСЗаписиКнигиПродаж.Покупатель,
	               |	ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.ГруппыОтчетности,
	               |	РеализацияУслугОбороты.Услуга,
	               |	РеализацияУслугОбороты.СуммаОборот,
	               |	ВЫБОР
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	               |			ТОГДА 0.18
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	               |			ТОГДА 0.1
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	               |			ТОГДА 0
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	               |			ТОГДА 0.2
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	               |			ТОГДА 0
	               |	КОНЕЦ,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	РеализацияУслугОбороты.СуммаОборот * ВЫБОР
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	               |			ТОГДА 0.18
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	               |			ТОГДА 0.1
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	               |			ТОГДА 0
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	               |			ТОГДА 0.2
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	               |			ТОГДА 0
	               |	КОНЕЦ + РеализацияУслугОбороты.СуммаОборот,
	               |	NULL,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	РегистрНакопления.РеализацияУслуг.Обороты(&C, &По, Авто, СчетРасходов = &С90021) КАК РеализацияУслугОбороты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	               |		ПО РеализацияУслугОбороты.Регистратор = НДСЗаписиКнигиПродаж.Регистратор
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДБГруппыКонтрагентовДляОплатЖКХАВА.СрезПоследних КАК ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних
	               |		ПО (НДСЗаписиКнигиПродаж.Организация = ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.Организация)
	               |			И (НДСЗаписиКнигиПродаж.Покупатель = ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.Контрагенты)
	               |ГДЕ
	               |	НДСЗаписиКнигиПродаж.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	               |	И РеализацияУслугОбороты.Организация = &Организация
	               |	И ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.ГруппыОтчетности = ЗНАЧЕНИЕ(Перечисление.ДБГруппыОтчетности.Бюджет)
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияУслугОбороты.Регистратор,
	               |	РеализацияУслугОбороты.Организация,
	               |	РеализацияУслугОбороты.Подразделение,
	               |	РеализацияУслугОбороты.НоменклатурнаяГруппа,
	               |	НДСЗаписиКнигиПродаж.Покупатель,
	               |	ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.ГруппыОтчетности,
	               |	РеализацияУслугОбороты.Услуга,
	               |	РеализацияУслугОбороты.СуммаОборот,
	               |	ВЫБОР
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	               |			ТОГДА 0.18
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	               |			ТОГДА 0.1
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	               |			ТОГДА 0
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	               |			ТОГДА 0.2
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	               |			ТОГДА 0
	               |	КОНЕЦ,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	NULL,
	               |	РеализацияУслугОбороты.СуммаОборот * ВЫБОР
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	               |			ТОГДА 0.18
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	               |			ТОГДА 0.1
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	               |			ТОГДА 0
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	               |			ТОГДА 0.2
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	               |			ТОГДА 0
	               |	КОНЕЦ + РеализацияУслугОбороты.СуммаОборот,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	РегистрНакопления.РеализацияУслуг.Обороты(&C, &По, Авто, СчетРасходов = &С90021) КАК РеализацияУслугОбороты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	               |		ПО РеализацияУслугОбороты.Регистратор = НДСЗаписиКнигиПродаж.Регистратор
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДБГруппыКонтрагентовДляОплатЖКХАВА.СрезПоследних КАК ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних
	               |		ПО (НДСЗаписиКнигиПродаж.Организация = ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.Организация)
	               |			И (НДСЗаписиКнигиПродаж.Покупатель = ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.Контрагенты)
	               |ГДЕ
	               |	НДСЗаписиКнигиПродаж.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	               |	И РеализацияУслугОбороты.Организация = &Организация
	               |	И ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.ГруппыОтчетности = ЗНАЧЕНИЕ(Перечисление.ДБГруппыОтчетности.Население)
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияУслугОбороты.Регистратор,
	               |	РеализацияУслугОбороты.Организация,
	               |	РеализацияУслугОбороты.Подразделение,
	               |	РеализацияУслугОбороты.НоменклатурнаяГруппа,
	               |	НДСЗаписиКнигиПродаж.Покупатель,
	               |	ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.ГруппыОтчетности,
	               |	РеализацияУслугОбороты.Услуга,
	               |	РеализацияУслугОбороты.СуммаОборот,
	               |	ВЫБОР
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	               |			ТОГДА 0.18
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	               |			ТОГДА 0.1
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	               |			ТОГДА 0
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	               |			ТОГДА 0.2
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	               |			ТОГДА 0
	               |	КОНЕЦ,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	NULL,
	               |	NULL,
	               |	РеализацияУслугОбороты.СуммаОборот * ВЫБОР
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	               |			ТОГДА 0.18
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	               |			ТОГДА 0.1
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	               |			ТОГДА 0
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	               |			ТОГДА 0.2
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	               |			ТОГДА 0
	               |	КОНЕЦ + РеализацияУслугОбороты.СуммаОборот,
	               |	NULL
	               |ИЗ
	               |	РегистрНакопления.РеализацияУслуг.Обороты(&C, &По, Авто, СчетРасходов = &С90021) КАК РеализацияУслугОбороты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	               |		ПО РеализацияУслугОбороты.Регистратор = НДСЗаписиКнигиПродаж.Регистратор
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДБГруппыКонтрагентовДляОплатЖКХАВА.СрезПоследних КАК ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних
	               |		ПО (НДСЗаписиКнигиПродаж.Организация = ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.Организация)
	               |			И (НДСЗаписиКнигиПродаж.Покупатель = ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.Контрагенты)
	               |ГДЕ
	               |	НДСЗаписиКнигиПродаж.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	               |	И РеализацияУслугОбороты.Организация = &Организация
	               |	И ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.ГруппыОтчетности = ЗНАЧЕНИЕ(Перечисление.ДБГруппыОтчетности.ПрочиеПотребители)
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияУслугОбороты.Регистратор,
	               |	РеализацияУслугОбороты.Организация,
	               |	РеализацияУслугОбороты.Подразделение,
	               |	РеализацияУслугОбороты.НоменклатурнаяГруппа,
	               |	НДСЗаписиКнигиПродаж.Покупатель,
	               |	ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.ГруппыОтчетности,
	               |	РеализацияУслугОбороты.Услуга,
	               |	РеализацияУслугОбороты.СуммаОборот,
	               |	ВЫБОР
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	               |			ТОГДА 0.18
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	               |			ТОГДА 0.1
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	               |			ТОГДА 0
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	               |			ТОГДА 0.2
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	               |			ТОГДА 0
	               |	КОНЕЦ,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	РеализацияУслугОбороты.СуммаОборот * ВЫБОР
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	               |			ТОГДА 0.18
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	               |			ТОГДА 0.1
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	               |			ТОГДА 0
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	               |			ТОГДА 0.2
	               |		КОГДА НДСЗаписиКнигиПродаж.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	               |			ТОГДА 0
	               |	КОНЕЦ + РеализацияУслугОбороты.СуммаОборот
	               |ИЗ
	               |	РегистрНакопления.РеализацияУслуг.Обороты(&C, &По, Авто, СчетРасходов = &С90021) КАК РеализацияУслугОбороты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСЗаписиКнигиПродаж КАК НДСЗаписиКнигиПродаж
	               |		ПО РеализацияУслугОбороты.Регистратор = НДСЗаписиКнигиПродаж.Регистратор
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДБГруппыКонтрагентовДляОплатЖКХАВА.СрезПоследних КАК ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних
	               |		ПО (НДСЗаписиКнигиПродаж.Организация = ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.Организация)
	               |			И (НДСЗаписиКнигиПродаж.Покупатель = ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.Контрагенты)
	               |ГДЕ
	               |	НДСЗаписиКнигиПродаж.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	               |	И РеализацияУслугОбороты.Организация = &Организация
	               |	И ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.ГруппыОтчетности <> ЗНАЧЕНИЕ(Перечисление.ДБГруппыОтчетности.ПрочиеПотребители)
	               |	И ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.ГруппыОтчетности <> ЗНАЧЕНИЕ(Перечисление.ДБГруппыОтчетности.Население)
	               |	И ДБГруппыКонтрагентовДляОплатЖКХАВАСрезПоследних.ГруппыОтчетности <> ЗНАЧЕНИЕ(Перечисление.ДБГруппыОтчетности.Бюджет)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Итог.Организация КАК Организация,
	               |	Итог.Услуга КАК Услуга,
	               |	СУММА(ЕСТЬNULL(Итог.Итог6, 0)) КАК Итог6,
	               |	СУММА(ЕСТЬNULL(Итог.Итог8, 0)) КАК Итог8,
	               |	СУММА(ЕСТЬNULL(Итог.Итог10, 0)) КАК Итог10,
	               |	СУММА(ЕСТЬNULL(Итог.Итог12, 0)) КАК Итог12,
	               |	СУММА(ЕСТЬNULL(Итог.Итог7, 0)) КАК Итог7,
	               |	СУММА(ЕСТЬNULL(Итог.Итог9, 0)) КАК Итог9,
	               |	СУММА(ЕСТЬNULL(Итог.Итог11, 0)) КАК Итог11,
	               |	СУММА(ЕСТЬNULL(Итог.Итог13, 0)) КАК Итог13
	               |ИЗ
	               |	Итог КАК Итог
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Итог.Организация,
	               |	Итог.Услуга";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",  Период.ДатаОкончания);
	//Если в движении в ХР (п.4.1) Субконто-3  Реализация датирована не текущим годом заданным в отборе отчета (предыдущие года), 
	//то сумму по номенклатуре включаем  в колонку Всего (по этому виду номенклатуры/Группы контрагента), и отдельно выносим сумму
	//в колонку < в том числе оплата задолженности за предыдущие годы>.
	ТекГодНачало = НачалоГода(ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("C", Дата("01.01.0001 0:00:00"));
	Запрос.УстановитьПараметр("По", ТекГодНачало);
	
	Запрос.УстановитьПараметр("С90021", ПланыСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД); //90.02.1
	Запрос.УстановитьПараметр("Организация", Организация);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ОбластьШапки    = Макет.ПолучитьОбласть("Шапка");
	ОбластьВсего    = Макет.ПолучитьОбласть("Всего");
	ОбластьСтрока   = Макет.ПолучитьОбласть("Строка");
	
	ОбластьШапки.Параметры.Организация  = Организация; 	
	ОбластьШапки.Параметры.Начало  = Формат(Период.ДатаНачала, "ДФ=dd.MM.yyyy"); 
	ОбластьШапки.Параметры.Конец   = Формат(Период.ДатаОкончания, "ДФ=dd.MM.yyyy"); 
	ТабличныйДокумент.Вывести(ОбластьШапки);
	
	ТабличныйДокумент.Вывести(ОбластьВсего);
	
	Номер  = 1;
	Итог6 = 0;
	Итог7 = 0;
	Итог8 = 0;
	Итог9 = 0;
	Итог10 = 0;
	Итог11 = 0;
	Итог12 = 0;
	Итог13 = 0;
	Пока Выборка.Следующий() Цикл
			
		ОбластьСтрока.Параметры.Услуга  = Выборка.Услуга; 	
		ОбластьСтрока.Параметры.Номер   = Номер; 
		ОбластьСтрока.Параметры.Итог6   = Выборка.Итог6; 
		Итог6 = Итог6 + Выборка.Итог6; 
		ОбластьСтрока.Параметры.Итог7   = Выборка.Итог7;  
		Итог7 = Итог7 + Выборка.Итог7;
		ОбластьСтрока.Параметры.Итог8   = Выборка.Итог8; 
		Итог8 = Итог8 + Выборка.Итог8;
		ОбластьСтрока.Параметры.Итог9   = Выборка.Итог9;
		Итог9 = Итог9 + Выборка.Итог9;
		ОбластьСтрока.Параметры.Итог10  = Выборка.Итог10;
		Итог10 = Итог10 + Выборка.Итог10;
		ОбластьСтрока.Параметры.Итог11  = Выборка.Итог11; 
		Итог11 = Итог11 + Выборка.Итог11;
		ОбластьСтрока.Параметры.Итог12  = Выборка.Итог12; 
		Итог12 = Итог12 + Выборка.Итог12;
		ОбластьСтрока.Параметры.Итог13  = Выборка.Итог13; 
		Итог13 = Итог13 + Выборка.Итог13;;
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		Номер = Номер + 1;
		
	КонецЦикла;
	
	ТабличныйДокумент.Область("R11C4").Текст = Итог6;
	ТабличныйДокумент.Область("R11C5").Текст = Итог7;
	ТабличныйДокумент.Область("R11C6").Текст = Итог8;
	ТабличныйДокумент.Область("R11C7").Текст = Итог9;
	ТабличныйДокумент.Область("R11C8").Текст = Итог10;
	ТабличныйДокумент.Область("R11C9").Текст = Итог11;
	ТабличныйДокумент.Область("R11C10").Текст = Итог12;
	ТабличныйДокумент.Область("R11C11").Текст = Итог13;
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции
